app/controllers/questions_controller.rb

  def create
    @question = Question.new(question_params)

    respond_to do |format|
      if @question.save
---
INSERT INTO "questions" ("created_at", "examcode", "opa", "opb", "opc", "opd", "question", "ro", "stopiccode", "subjectcode", "topiccode", "updated_at", "year") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)