app/controllers/questions_controller.rb

  def create
    @question = Question.new(question_params)

    respond_to do |format|
      if @question.save
---
INSERT INTO "questions" ("created_at", "opa", "opb", "opc", "opd", "question", "ro", "updated_at", "year") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @question.update(question_params)
---
UPDATE "questions" SET "question" = ?, "updated_at" = ? WHERE "questions"."id" = 3  [["question", "1"], ["updated_at", Sun, 11 Jan 2015 18:14:21 UTC +00:00]]